ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_i3c.h
/***************************************************************************//**
* \file cy_i3c.h
* \version 1.00
*
* Provides I3C API declarations for the I3C Controller.
*
********************************************************************************
* \copyright
* Copyright 2019-2020 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_cy_i3c
* \{
* Driver API for I3C Bus Peripheral
*
* I3C - The Improved Inter-Integrated Circuit (I3C) bus is a MIPI industry-standard.
*
* The functions and other declarations used in this part of the driver are in 
* cy_i3c.h. You can also include cy_pdl.h to get access to all functions and declarations 
* in the PDL.
*
* The I3C peripheral driver provides an API to implement I3C in Slave, Main-Master,
* or Secondary-Master roles based on the DW I3C hardware block.
* This I3C bus is capable of supporting I3C as well as I2C slave devices as defined
* in the specification. 
* I2C slaves are supported with Fast-mode, and Fast-mode Plus with external 50ns
* spike filter as per I3C specification.
*
* Features:
* * An industry-standard I3C bus interface
* * Supports slave, main master, and secondary master operation
* * SCL frequency up to 12.5MHz (SDR data rate 12.5Mbps, HDR-DDR data rate at 25Mbps)
* * In master mode, number of addressable slave devices is 11
* * Works in active power mode only
* * Does not support I3C HDR-TSP/TSR modes
* * Does not support I3C CDR (clock data recovery)
* * Does not support I3C address arbitration optimizations
* * Does not support I3C IBI with data
* * Does not support I3C time stamping
* * Does not support vendor specific CCCs
* * Does not support I2C slave role
*
********************************************************************************
* \section group_cy_i3c_configuration Configuration Considerations
********************************************************************************
* The I3C driver configuration can be divided to number of sequential
* steps listed below:
* * \ref group_i3c_config
* * \ref group_i3c_pins
* * \ref group_i3c_clock
* * \ref group_i3c_data_rate
* * \ref group_i3c_intr
* * \ref group_i3c_enable
*
********************************************************************************
* \subsection group_i3c_config Configure i3c
********************************************************************************
* To set up the I3C  driver, provide the configuration parameters in the
* \ref cy_stc_i3c_config_t structure. Provide i3cMode to the select
* operation mode slave, master or secondary master-slave.
* To initialize the driver, call \ref Cy_I3C_Init function providing a 
* pointer to the populated \ref cy_stc_i3c_config_t
* structure and the allocated \ref cy_stc_i3c_context_t structure.
*
* For I3C slave setup read and write buffer before enabling its
* operation using \ref Cy_I3C_SlaveConfigReadBuf and \ref
* Cy_I3C_SlaveConfigWriteBuf appropriately. Note that the master reads
* data from the slave read buffer and writes data into the slave write buffer.
*
********************************************************************************
* \subsection group_i3c_pins Assign and Configure Pins
********************************************************************************
* Only dedicated  pins can be used for I3C operation. The HSIOM
* register must be configured to connect dedicated I3C pins to the 
* block. Also the open-drain enable pin for I3C must be configured in open-drain
* with internal pull up enabled
* (this pin configuration implies usage of external pull-up resistors)
*
********************************************************************************
* \subsection group_i3c_clock Assign Clock Divider
********************************************************************************
* A clock source must be connected to the  block to oversample input and
* output signals, in this document this clock will be referred as clk_i3c.
* You must use one of the 8-bit or 16-bit dividers. Use the \ref group_sysclk 
* driver API to do this.
*
********************************************************************************
* \subsection group_i3c_data_rate Configure Data Rate
********************************************************************************
* To get I3C slave operation with the desired data rate, the clk_i3c must be
* fast enough to provide sufficient oversampling. Use the
* \ref group_sysclk driver API to do this.
*
* To get I3C master operation with the desired data rate, the source clock
* frequency and SCL low and high phase duration must be configured. Use the
* \ref group_sysclk driver API to configure source clock frequency. Then call
* \ref Cy_I3C_SetDataRate to set the SCL low, high phase duration 
* This function sets SCL low and high phase settings based on 
* source clock frequency.
*
********************************************************************************
* \subsection group_i3c_intr Configure Interrupt
********************************************************************************
* The interrupt is mandatory for I3C operation. 
* The driver provides three interrupt functions: \ref Cy_I3C_Interrupt,
* \ref Cy_I3C_SlaveInterrupt, and \ref Cy_I3C_MasterInterrupt. One of
* these functions must be called in the interrupt handler for the selected 
* instance. Call \ref Cy_I3C_SlaveInterrupt when I3C is configured to
* operate as a slave, \ref Cy_I3C_MasterInterrupt when I3C is configured
* to operate as a master and \ref Cy_I3C_Interrupt when I3C is configured
* to operate as master and slave. Using the slave- or master-specific interrupt
* function allows reducing the flash consumed by the I3C driver. Also this
* interrupt must be enabled in the NVIC otherwise it will not work.
* \note
* The I3C driver documentation refers to the \ref Cy_I3C_Interrupt function
* when interrupt processing is mandatory for the operation. This is done to
* simplify the readability of the driver's documentation. The application should
*  call the slave- or master-specific interrupt functions \ref Cy_I3C_SlaveInterrupt
* or \ref Cy_I3C_MasterInterrupt, when appropriate.
*
********************************************************************************
* \subsection group_i3c_enable Enable I3C
********************************************************************************
* Finally, enable the I3C operation by calling \ref Cy_I3C_Enable. Then I3C
* slave starts respond to the assigned address and I3C master ready to execute
* transfers.
*
********************************************************************************
* \section group_i3c_use_cases Common Use Cases
********************************************************************************
* \subsection group_i3c_master_mode Master Operation
********************************************************************************
* Call \ref Cy_I3C_MasterRead or \ref Cy_I3C_MasterWrite to
* communicate with the slave. These functions do not block and only start a
* transaction. After a transaction starts, the \ref Cy_I3C_Interrupt
* handles further data transaction until its completion (successfully or 
* with error occurring). To monitor the transaction,
* use \ref Cy_I3C_GetBusStatus or register callback function using
* \ref Cy_I3C_RegisterEventCallback to be notified about
* \ref group_i3c_macros_callback_events.
*
********************************************************************************
* \subsection group_i3c_slave Slave Operation
********************************************************************************
* Slave operation requires the \ref Cy_I3C_Interrupt be
* called inside the interrupt handler. The read and write buffers must
* be provided for the slave to enable communication with the master. Use
* \ref Cy_I3C_SlaveConfigReadBuf and \ref Cy_I3C_SlaveConfigWriteBuf
* for this purpose. Note that after transaction completion the buffer must be
* configured again. Otherwise, the same buffer is used starting from the point
* where the master stopped a previous transaction.
* For example: The read buffer is configured to be 10 bytes and the master reads
* 8 bytes. If the read buffer is not configured again, the next master read
* will start from the 9th byte.
* To monitor the transaction status, use \ref Cy_I3C_GetBusStatus or
* use \ref Cy_I3C_RegisterEventCallback to register a callback function
* to be notified about \ref group_i3c_macros_callback_events.
*
********************************************************************************
* \section group_i3c_lp Low Power Support
********************************************************************************
* The I3C driver provides callback functions to handle power mode transition.
* The callback \ref Cy_I3C_DeepSleepCallback must be called
* during execution of \ref Cy_SysPm_CpuEnterDeepSleep \ref Cy_I3C_HibernateCallback
* must be called during execution of \ref Cy_SysPm_SystemEnterHibernate. To trigger the
* callback execution, the callback must be registered before calling the
* power mode transition function. Refer to \ref group_syspm driver for more
* information about power mode transitions and callback registration.
*
* \defgroup group_i3c_macros Macros
* \defgroup group_i3c_enums Enumerated Types
* \defgroup group_i3c_data_structures Data Structures
* \defgroup group_i3c_functions Functions
* \{
* \defgroup group_i3c_general_functions General
* \defgroup group_i3c_slave_functions Slave
* \defgroup group_i3c_master_functions Master 
* \defgroup group_i3c_secondary_master_functions Secondary Master
* \defgroup group_i3c_interrupt_functions Interrupt
* \defgroup group_i3c_low_power_functions Low Power Callbacks
* \}
*/

#if !defined (CY_I3C_H)
#define CY_I3C_H

#include "cy_device_headers.h"
#include "cy_device.h"

