ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_i3c.h
#if defined (CY_IP_MXI3C)

#include "cy_syspm.h"
#include "cy_i3c_ccc.h"

#if defined(__cplusplus)
extern "C" {
#endif

/******************************************************************************
 *                              Constants                                     *
 ******************************************************************************/

/**
* \addtogroup group_i3c_macros
* \{
*/

/** Driver major version */
#define CY_I3C_DRV_VERSION_MAJOR    (1)  //What should these be?

/** Driver minor version */
#define CY_I3C_DRV_VERSION_MINOR    (0)  //What should these be??

/** I3C driver identifier */
#define CY_I3C_ID           CY_PDL_DRV_ID(0x2AU) //TBD - What should be here?

/**
* \addtogroup group_i3c_macros_common_macros Common Macros
* \{
*/

/** Max device address value */
#define CY_I3C_MAX_ADDR CY_I3C_GENMASK(6, 0)

/** Max number of slave devices addressable in master mode */
#define CY_I3C_MAX_DEVS (11)

/** I3C Broadcast Address */
#define CY_I3C_BROADCAST_ADDR    (0x7E)

/** \} group_i3c_macros_common_macros */

/**
* \defgroup group_i3c_macros_intr_macros Interrupt Status
* \{
*/

/**
* The number of empty locations in the transmit buffer is greater than or 
* equal to the specified threshold value.
*/
#define CY_I3C_INTR_TX_BUFFER_THLD_STS I3C_CORE_INTR_STATUS_TX_THLD_STS_Msk

/**
* The number of elements in the receive buffer is greater than or 
* equal to the specified threshold value.
*/
#define CY_I3C_INTR_RX_BUFFER_THLD_STS I3C_CORE_INTR_STATUS_RX_THLD_STS_Msk

/**
* The number of elements in the IBI buffer is greater than or 
* equal to the specified threshold value.
*/
#define CY_I3C_INTR_IBI_BUFFER_THLD_STS I3C_CORE_INTR_STATUS_IBI_THLD_STS_Msk

/**
* The number of empty locations in the command queue is greater than or 
* equal to the specified threshold value.
*/
#define CY_I3C_INTR_CMD_QUEUE_READY_STS I3C_CORE_INTR_STATUS_CMD_QUEUE_READY_STS_Msk

/**
* The number of elements in the response queue is greater than or 
* equal to the specified threshold value.
*/
#define CY_I3C_INTR_RESP_READY_STS I3C_CORE_INTR_STATUS_RESP_READY_STS_Msk

/**
* The transfer is aborted.
*/
#define CY_I3C_INTR_TRANSFER_ABORT_STS I3C_CORE_INTR_STATUS_TRANSFER_ABORT_STS_Msk

/**
* The CCC registers are updated by the I3C Master through CCC commands.
*/
#define CY_I3C_INTR_CCC_UPDATED_STS I3C_CORE_INTR_STATUS_CCC_UPDATED_STS_Msk

/**
* The dynamic address of the device is assigned through SETDASA or ENTDAA CCC
*/
#define CY_I3C_INTR_DYN_ADDR_ASSGN_STS I3C_CORE_INTR_STATUS_DYN_ADDR_ASSGN_STS_Msk

/**
* Error occured in the transfer. 
*/
#define CY_I3C_INTR_TRANSFER_ERR_STS I3C_CORE_INTR_STATUS_TRANSFER_ERR_STS_Msk

/**
* DEFSLV CCC is received.
*/
#define CY_I3C_INTR_DEFSLV_STS I3C_CORE_INTR_STATUS_DEFSLV_STS_Msk

/**
* The read request is received from the current master; command queue is empty.
*/
#define CY_I3C_INTR_READ_REQ_RECV_STS I3C_CORE_INTR_STATUS_READ_REQ_RECV_STS_Msk

/**
* The IBI request initiated via SIR request register is addressed and status is updated.
*/
#define CY_I3C_INTR_IBI_UPDATED_STS I3C_CORE_INTR_STATUS_IBI_UPDATED_STS_Msk

/**
* The role of the controller is changed.
*/
#define CY_I3C_INTR_BUSOWNER_UPDATED_STS I3C_CORE_INTR_STATUS_BUSOWNER_UPDATED_STS_Msk

/**
* Provides the list of allowed sources for slave mode.
*/
#define CY_I3C_SLV_INTR_Msk (CY_I3C_INTR_CCC_UPDATED_STS | CY_I3C_INTR_DYN_ADDR_ASSGN_STS | \
                             CY_I3C_INTR_RESP_READY_STS | CY_I3C_INTR_READ_REQ_RECV_STS )
                             
/** \} group_i3c_macros_intr_macros */

/**
* \defgroup group_i3c_macros_master_status I3C Master Status
* Macros to check current I3C master status returned by 
* \ref Cy_I3C_GetBusStatus function. Each I3C master status is encoded 
* in a separate bit, therefore multiple bits may be set to indicate the 
* current status.
* \{
*/

/**
* The master is busy executing operation started by \ref Cy_I3C_SendCCCCmd or
* \ref Cy_I3C_MasterRead or \ref Cy_I3C_MasterWrite or \ref Cy_I3C_MasterStartEntDaa
* \ref Cy_I3C_MasterSendHdrCmds.
*/
#define CY_I3C_MASTER_BUSY                          (0x00010000UL)

/**
* The master has currently performed a broadcast CCC write transfer
*/
#define CY_I3C_MASTER_BROADCAST_CCC_WR_XFER         (0x00000001UL)

/**
* The master has currently performed a directed CCC write transfer
*/
#define CY_I3C_MASTER_DIRECTED_CCC_WR_XFER          (0x00000002UL)

/**
* The master has currently performed a broadcast CCC read transfer
*/
#define CY_I3C_MASTER_DIRECTED_CCC_RD_XFER          (0x00000004UL)

/**
* The master has currently performed DAA
*/
#define CY_I3C_MASTER_ENTDAA_XFER                   (0x00000008UL)

/**
* The master has currently performed a privete SDR write to an I3C Slave
*/
#define CY_I3C_MASTER_I3C_SDR_WR_XFER               (0x00000010UL)

/**
* The master has currently performed a privete SDR read from an I3C Slave
*/
#define CY_I3C_MASTER_I3C_SDR_RD_XFER               (0x00000020UL)

/**
* The master has currently performed a privete SDR read to an I2C Slave
*/
#define CY_I3C_MASTER_I2C_SDR_WR_XFER               (0x00000040UL)

/**
* The master has currently performed a privete SDR read from an I2C Slave
*/
#define CY_I3C_MASTER_I2C_SDR_RD_XFER               (0x00000080UL)

/**
* The master has currently performed a private HDR write in DDR mode
*/
#define CY_I3C_MASTER_HDR_DDR_WR_XFER               (0x00000100UL)

/**
* The master has currently performed a private HDR read in DDR mode
*/
#define CY_I3C_MASTER_HDR_DDR_RD_XFER               (0x00000200UL)

/**
* The master has currently responded to a IBI request
*/
#define CY_I3C_MASTER_IBI_XFER                      (0x00000400UL)

/**
* The master is in HALT state due to error in the transfer
*/
#define CY_I3C_MASTER_HALT_STATE                    (0x00000800UL) //This is the BUS_ERR - Ask

/**
* The transaction was aborted 
*/
#define CY_I3C_MASTER_XFER_ABORTED                  (0X00001000UL)

/** \} group_i3c_macros_master_status */

/**
* \defgroup group_i3c_macros_slave_status I3C Slave Status
* Macros to check current I3C slave status returned by 
* \ref Cy_I3C_GetBusStatus function. Each I3C slave status is encoded 
* in a separate bit, therefore multiple bits may be set to indicate the 
* current status.
* \{
*/

/**
* The master has finished reading data from the slave
*/
#define CY_I3C_SLAVE_RD_CMPLT      (0x00002000UL)

/**
* The master has finished writing data into the slave
*/
#define CY_I3C_SLAVE_WR_CMPLT      (0x00004000UL)

