ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_i3c.h
/** There is a read transaction in progress */
#define CY_I3C_SLAVE_RD_BUSY       (0x00008000UL)
 
/** There is a write transaction in progress */
#define CY_I3C_SLAVE_WR_BUSY       (0x00010000UL)

/** \} group_i3c_macros_slave_status */

/**
* \defgroup group_i3c_macros_callback_events I3C Callback Events
* \{
* Macros to check I3C events passed by \ref cy_cb_i3c_handle_events_t callback.
* Each event is encoded in a separate bit, and therefore it is possible to
* notify about multiple events.
*/

/** The master write started by \ref Cy_I3C_MasterWrite is complete */
#define CY_I3C_MASTER_WR_CMPLT_EVENT       (0x00000001UL)

/** The master read started by \ref Cy_I3C_MasterRead is complete */
#define CY_I3C_MASTER_RD_CMPLT_EVENT       (0x00000002UL)

/** CY_I3C_MASTER_WR_EARLY_TERMINATION_EVENT */
#define CY_I3C_MASTER_WR_EARLY_TERMINATION_EVENT   (0x00000004UL)

/**
* Indicates the I3C hardware has detected an error.
*/

/** CY_I3C_CRC_ERROR_EVENT */
#define CY_I3C_CRC_ERROR_EVENT                    (0x00000008UL)
/** CY_I3C_PARITY_ERROR_EVENT */
#define CY_I3C_PARITY_ERROR_EVENT                 (0x00000010UL)
/** CY_I3C_FRAME_ERROR_EVENT */
#define CY_I3C_FRAME_ERROR_EVENT                  (0x00000020UL)
/** CY_I3C_BROADCAST_ADDR_NACK_ERROR_EVENT */
#define CY_I3C_BROADCAST_ADDR_NACK_ERROR_EVENT    (0x00000040UL)
/** CY_I3C_ADDR_NACK_ERROR_EVENT */
#define CY_I3C_ADDR_NACK_ERROR_EVENT              (0x00000080UL)
/** CY_I3C_BUFFER_OVERFLOW_ERROR_EVENT */
#define CY_I3C_BUFFER_OVERFLOW_ERROR_EVENT        (0x00000100UL)
/** CY_I3C_XFER_ABORTED_ERROR_EVENT */
#define CY_I3C_XFER_ABORTED_ERROR_EVENT           (0x00000200UL)
/** CY_I3C_I2C_SLV_WDATA_NACK_ERROR_EVENT */
#define CY_I3C_I2C_SLV_WDATA_NACK_ERROR_EVENT     (0x00000400UL)
/** CY_I3C_MASTER_EARLY_TERMINATION_EVENT */
#define CY_I3C_MASTER_EARLY_TERMINATION_EVENT     (0x00000800UL)
/** CY_I3C_MASTER_ERROR_M0_EVENT */
#define CY_I3C_MASTER_ERROR_M0_EVENT              (0X00001000UL)

/** CY_I3C_MASTER_ERR_EVENT */
#define CY_I3C_MASTER_ERR_EVENT                   (CY_I3C_CRC_ERROR_EVENT| CY_I3C_PARITY_ERROR_EVENT| CY_I3C_FRAME_ERROR_EVENT| \
                                                   CY_I3C_BROADCAST_ADDR_NACK_ERROR_EVENT| CY_I3C_ADDR_NACK_ERROR_EVENT| CY_I3C_BUFFER_OVERFLOW_ERROR_EVENT| \
                                                   CY_I3C_XFER_ABORTED_ERROR_EVENT| CY_I3C_I2C_SLV_WDATA_NACK_ERROR_EVENT| CY_I3C_MASTER_ERROR_M0 )

/** CY_I3C_SLAVE_ERR_EVENT */
#define CY_I3C_SLAVE_ERR_EVENT                    (CY_I3C_CRC_ERROR_EVENT| CY_I3C_PARITY_ERROR_EVENT| CY_I3C_FRAME_ERROR_EVENT| \
                                                   CY_I3C_BUFFER_OVERFLOW_ERROR_EVENT | CY_I3C_MASTER_EARLY_TERMINATION_EVENT)

/** The slave device is assigned a dynamic address through SETDASA or ENTDAA CCC from the master */
#define CY_I3C_SLAVE_ASSIGNED_DYN_ADDR_EVENT     (0X00002000UL)

/**
* The master has read all data out of the configured Read buffer.
* This event can be used to configure the next Read buffer. If the buffer
* remains empty, the CY_I3C_DEFAULT_TX bytes are returned to the master.
*/

/** CY_I3C_SLAVE_RD_BUF_EMPTY_EVENT */
#define CY_I3C_SLAVE_RD_BUF_EMPTY_EVENT    (0x00004000UL)

/** CY_I3C_SLAVE_MAX_RD_LEN_UPDT_EVENT */
#define CY_I3C_SLAVE_MAX_RD_LEN_UPDT_EVENT (0X00008000UL)

/** CY_I3C_SLAVE_MAX_WR_LEN_UPDT_EVENT */
#define CY_I3C_SLAVE_MAX_WR_LEN_UPDT_EVENT (0X00010000UL)

/**
* Indicates the master completed reading from the slave (set by the master NAK
* or Stop)
*/
#define CY_I3C_SLAVE_RD_CMPLT_EVENT        (0x00020000UL)

/**
* Indicates the master completed writing to the slave (set by the master Stop
* or Restart)
*/
#define CY_I3C_SLAVE_WR_CMPLT_EVENT        (0x00040000UL)

/**
* One of the CCC register is updated by I3C Master through CCC commands
*/
#define CY_I3C_SLAVE_CCC_REG_UPDATED_EVENT        (0x00080000UL)

/**
* There is no valid command in the command queue
*/
#define CY_I3C_SLAVE_NO_VALID_CMD_IN_CMDQ_EVENT        (0x00100000UL)

/**
* The data in Tx FIFO is not equal to the data length size of the command 
* or the TX_START_THLD value or the Response queue is full
*/
#define CY_I3C_SLAVE_DATA_NOT_READY_EVENT        (0x00200000UL)

/**
* DEFSLVS CCC is received.
*/
#define CY_I3C_DEFSLV_EVENT        (0x00400000UL)

/**
* Role of the controller changed from Master to Slave or vice-versa
*/
#define CY_I3C_CONTROLLER_ROLE_UPDATED_EVENT       (0x00800000UL)


/** \} group_i3c_macros_callback_events */

/** \cond INTERNAL */

/* COMMAND_QUEUE_PORT Register */
#define I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_Pos 0UL
#define I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_Msk 0x7UL
/* Transfer Command Structure */
#define I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_TRANSFER_CMD 0x0UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TID_Pos 3UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TID_Msk 0x78UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_CMD_Pos 7UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_CMD_Msk 0x7F80UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_CP_Pos 15UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_CP_Msk 0x8000UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_DEV_INDX_Pos 16UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_DEV_INDX_Msk 0x1F0000UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_SPEED_Pos 21UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_SPEED_Msk 0xE00000UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_ROC_Pos 26UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_ROC_Msk 0x4000000UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_SDAP_Pos 27UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_SDAP_Msk 0x8000000UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_RnW_Pos 28UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_RnW_Msk 0x10000000UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TOC_Pos 30UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TOC_Msk 0x40000000UL
/* Transfer Argument Command Structure */
#define I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_TRANSFER_ARG 0x01
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_ARG_DATA_LENGTH_Pos 16UL
#define I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_ARG_DATA_LENGTH_Msk 0xFFFF0000UL
/* Short Data Argument Structure */
#define I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_SHORT_DATA_ARG 0x02UL
#define I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_BYTE_STRB_Pos 3UL
#define I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_BYTE_STRB_Msk 0x38UL
#define I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_DATA_BYTE_0_Pos 8UL
#define I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_DATA_BYTE_0_Msk 0xFF00UL
#define I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_DATA_BYTE_1_Pos 16UL
#define I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_DATA_BYTE_1_Msk 0xFF0000UL
#define I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_DATA_BYTE_2_Pos 23UL
#define I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_DATA_BYTE_2_Msk 0xFF000000UL
/* To select the valid data bytes of the Short Data Argument */
#define CY_I3C_BYTE_STROBE1 1UL
#define CY_I3C_BYTE_STROBE2 3UL
#define CY_I3C_BYTE_STROBE3 7UL
/* Address Assignment Command Structure */
#define I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_ADDR_ASSGN_CMD 0x03UL
#define I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_TID_Pos 0x3UL
#define I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_TID_Msk 0x78UL
#define I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_CMD_Pos 7UL
#define I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_CMD_Msk 0x7F80UL
#define I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_DEV_INDX_Pos 16UL
#define I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_DEV_INDX_Msk 0x1F0000UL
#define I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_DEV_COUNT_Pos 21UL
#define I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_DEV_COUNT_Msk 0x3E00000UL
#define I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_ROC_Pos 26UL
#define I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_ROC_Msk 0x4000000UL
#define I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_TOC_Pos 30UL
#define I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_TOC_Msk 0x40000000UL

/*  RESPONSE_QUEUE_PORT Register  */
#define I3C_CORE_MASTER_RESPONSE_QUEUE_PORT_DATA_LENGTH_Pos 0UL
#define I3C_CORE_MASTER_RESPONSE_QUEUE_PORT_DATA_LENGTH_Msk 0xFFFFUL
#define I3C_CORE_MASTER_RESPONSE_QUEUE_PORT_CCCT_Pos 16UL
#define I3C_CORE_MASTER_RESPONSE_QUEUE_PORT_CCCT_Msk 0xFF0000UL
#define I3C_CORE_MASTER_RESPONSE_QUEUE_PORT_TID_Pos 24UL
#define I3C_CORE_MASTER_RESPONSE_QUEUE_PORT_TID_Msk 0xF000000UL
#define I3C_CORE_MASTER_RESPONSE_QUEUE_PORT_ERR_STS_Pos 28UL
#define I3C_CORE_MASTER_RESPONSE_QUEUE_PORT_ERR_STS_Msk 0xF0000000UL

