ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_i3c.h
#define I3C_CORE_SLAVE_RESPONSE_QUEUE_PORT_DATA_LENGTH_Pos 0UL
#define I3C_CORE_SLAVE_RESPONSE_QUEUE_PORT_DATA_LENGTH_Msk 0xFFFFUL
#define I3C_CORE_SLAVE_RESPONSE_QUEUE_PORT_CCC_HDR_HEADER_Pos 16UL
#define I3C_CORE_SLAVE_RESPONSE_QUEUE_PORT_CCC_HDR_HEADER_Msk 0xFF0000UL
#define I3C_CORE_SLAVE_RESPONSE_QUEUE_PORT_TID_Pos 24UL
#define I3C_CORE_SLAVE_RESPONSE_QUEUE_PORT_TID_Msk 0x7000000UL
#define I3C_CORE_SLAVE_RESPONSE_QUEUE_PORT_RX_RSP_Pos 27UL
#define I3C_CORE_SLAVE_RESPONSE_QUEUE_PORT_RX_RSP_Msk 0x8000000UL
#define I3C_CORE_SLAVE_RESPONSE_QUEUE_PORT_ERR_STS_Pos 28UL
#define I3C_CORE_SLAVE_RESPONSE_QUEUE_PORT_ERR_STS_Msk 0xF0000000UL

/* BCR Register */
#define CY_I3C_CORE_BCR_DEVICE_ROLE_Msk            (0xC0)
#define CY_I3C_CORE_BCR_I3C_SLAVE                (0 << 6)
#define CY_I3C_CORE_BCR_I3C_MASTER                (1 << 6)
#define CY_I3C_CORE_BCR_HDR_CAP_Msk                (0x20)
#define CY_I3C_CORE_BCR_BRIDGE_Msk                (0x10)
#define CY_I3C_CORE_BCR_OFFLINE_CAP_Msk            (0x08)
#define CY_I3C_CORE_BCR_IBI_PAYLOAD_Msk            (0x04)
#define CY_I3C_CORE_BCR_IBI_REQ_CAP_Msk            (0x02)
#define CY_I3C_CORE_BCR_MAX_DATA_SPEED_LIM_Msk    (0x01)

/* LVR register */
#define CY_I3C_LVR_LEGACY_I2C_INDEX_MASK        (0xE0)
#define CY_I3C_LVR_I2C_MODE_INDICATOR            (0x10)

/* IBI Identifiers */
#define CY_I3C_HOT_JOIN_ADDR                        (0x02)
#define CY_I3C_IBI_QUEUE_IBI_ADDR(x)                ((x) >> 1)
#define CY_I3C_IBI_TYPE_HOT_JOIN(x)                    (CY_I3C_IBI_QUEUE_IBI_ADDR((x)) == CY_I3C_HOT_JOIN_ADDR && !((x) & CY_I3C_BIT(0)))
#define CY_I3C_IBI_TYPE_MASTERSHIP_REQUEST(x)        (CY_I3C_IBI_QUEUE_IBI_ADDR((x)) != CY_I3C_HOT_JOIN_ADDR && !((x) & CY_I3C_BIT(0)))
#define CY_I3C_IBI_TYPE_SIR_REQUEST(x)                (CY_I3C_IBI_QUEUE_IBI_ADDR((x)) != CY_I3C_HOT_JOIN_ADDR && ((x) & CY_I3C_BIT(0)))
#define CY_I3C_IBI_SIR_REQ_ID(x)                    ((((x) & CY_I3C_GENMASK(6, 5)) >> 5) + ((x) & CY_I3C_GENMASK(4, 0)))

/* Interrupt Mask */
#define CY_I3C_INTR_MASK ( I3C_CORE_INTR_STATUS_EN_TX_THLD_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_RX_THLD_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_IBI_THLD_STS_EN_Msk    | \
                           I3C_CORE_INTR_STATUS_EN_CMD_QUEUE_READY_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_RESP_READY_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_TRANSFER_ABORT_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_CCC_UPDATED_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_DYN_ADDR_ASSGN_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_TRANSFER_ERR_STS_EN_Msk    | \
                           I3C_CORE_INTR_STATUS_EN_DEFSLV_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_READ_REQ_RECV_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_IBI_UPDATED_STS_EN_Msk  | \
                           I3C_CORE_INTR_STATUS_EN_BUSOWNER_UPDATED_STS_EN_Msk )

/* I3C states */
#define CY_I3C_IDLE              (0x10000000UL)
#define CY_I3C_IDLE_MASK         (0x10000000UL)

/* Master states */
#define CY_I3C_MASTER_ACTIVE     (0X00100000UL)
#define CY_I3C_MASTER_RX         (0x00100001UL)
#define CY_I3C_MASTER_TX         (0x00100002UL)

/* Slave states */
#define CY_I3C_SLAVE_ACTIVE      (0x00001000UL)
#define CY_I3C_SLAVE_RX          (0x00001001UL)
#define CY_I3C_SLAVE_TX          (0x00001002UL)

/* FIFO size */
#define CY_FIFO_SIZE              (256UL)

#define CY_I3C_FIFO_SIZE           CY_FIFO_SIZE
#define CY_I3C_HALF_FIFO_SIZE     (CY_FIFO_SIZE / 2UL)

#define CY_I3C_DEFAULT_RETURN    (0xFFUL)

/* Convert the timeout in milliseconds to microseconds */
#define CY_I3C_CONVERT_TIMEOUT_TO_US(timeoutMs)     ((timeoutMs) * 1000UL)

/* I3C data rates */
#define CY_I3C_SDR_DATA_RATE            (12500000U)
#define CY_I3C_SDR1_DATA_RATE            (8000000U)
#define CY_I3C_SDR2_DATA_RATE            (6000000U)
#define CY_I3C_SDR3_DATA_RATE            (4000000U)
#define CY_I3C_SDR4_DATA_RATE            (2000000U)
#define CY_I3C_HDRDDR_DATA_RATE            (25000000U)
#define CY_I3C_BUS_I2C_FM_TLOW_MIN_NS    (1300)
#define CY_I3C_BUS_I2C_FMP_TLOW_MIN_NS    (500)
#define CY_I3C_BUS_THIGH_MAX_NS            (41)
#define CY_I3C_SCL_I3C_TIMING_CNT_MIN    (5)


/* I2C data rates max (Hz): standard, fast and fast plus modes */
#define CY_I3C_I2C_FM_DATA_RATE    (400000U)
#define CY_I3C_I2C_FMP_DATA_RATE  (1000000U)

#define CY_I3C_IS_MODE_VALID(mode)      ( (CY_I3C_SLAVE  == (mode)) || \
                                              (CY_I3C_MASTER == (mode)) || \
                                              (CY_I3C_SECONDARY_MASTER == (mode)) )
#define CY_I3C_IS_BUS_MODE_VALID(mode)      ( (CY_I3C_BUS_PURE  == (mode)) || \
                                                   (CY_I3C_BUS_MIXED_FAST == (mode)) || \
                                                       (CY_I3C_BUS_MIXED_SLOW == (mode)) )
#define CY_I3C_INTR_VALID(intr, mask)            ( 0UL == ((intr) & ((uint32_t) ~(mask))) )

#define CY_I3C_IS_SDR_DATA_RATE_VALID(dataRateHz)   ( ((dataRateHz) > 0UL) && \
                                                      ((dataRateHz) <= CY_I3C_SDR_DATA_RATE) )

#define CY_I3C_IS_HDR_DATA_RATE_VALID(dataRateHz)   ( ((dataRateHz) > 0UL) && \
                                                      ((dataRateHz) <= CY_I3C_HDRDDR_DATA_RATE) )

#define CY_I3C_IS_TIMEOUT_VALID(timeoutMs)              ( (timeoutMs) <= (0xFFFFFFFFUL / 1000UL) )

#define CY_IS_I3C_ADDR_VALID(addr)              ( (0U == ((addr) & 0x80U)) )

#define CY_IS_I3C_BUFFER_VALID(buffer, size)    ( (NULL != (buffer)) && ((size) > 0UL) )

#define CY_I3C_IS_BUFFER_SIZE_VALID(size)      ( ((size) > 0UL) && \
                                                      ((size) <= CY_I3C_FIFO_SIZE) )


/* Default Values */

#define I3C_CORE_QUEUE_THLD_CTRL_DEF_VAL  (_VAL2FLD(I3C_CORE_QUEUE_THLD_CTRL_CMD_EMPTY_BUF_THLD, 1UL) | \
                                           _VAL2FLD(I3C_CORE_QUEUE_THLD_CTRL_RESP_BUF_THLD, 1UL) | \
                                           _VAL2FLD(I3C_CORE_QUEUE_THLD_CTRL_IBI_STATUS_THLD, 1UL))

#define I3C_CORE_DATA_BUFFER_THLD_CTRL_DEF_VAL (_VAL2FLD(I3C_CORE_DATA_BUFFER_THLD_CTRL_TX_EMPTY_BUF_THLD, 1UL) | \
                                                _VAL2FLD(I3C_CORE_DATA_BUFFER_THLD_CTRL_RX_BUF_THLD, 1UL) | \
                                                _VAL2FLD(I3C_CORE_DATA_BUFFER_THLD_CTRL_TX_START_THLD, 1UL) | \
                                                _VAL2FLD(I3C_CORE_DATA_BUFFER_THLD_CTRL_RX_START_THLD, 1UL))

/** \endcond */

/** \} group_i3c_macros */

