ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_i3c.h
/*******************************************************************************
*                            Enumerated Types
*******************************************************************************/

/**
* \addtogroup group_i3c_enums
* \{
*/
    
/** I3C status codes */
typedef enum
{
    /** Operation completed successfully */
    CY_I3C_SUCCESS = 0U,

    /** One or more of input parameters are invalid */
    CY_I3C_BAD_PARAM = (CY_I3C_ID| CY_PDL_STATUS_ERROR | 1U),

    /**
    * The master is not ready to start a new transaction.
    * Either the master is still processing a previous transaction or in the
    * master-slave mode, the slave operation is in progress.
    */
    CY_I3C_MASTER_NOT_READY = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 2U),

    /**
    * The master failed to attach the slave device to the bus
    * as there already exists maximum number of devices on the bus.
    */
    CY_I3C_MASTER_MAX_DEVS_PRESENT = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 3U),

    /**
    * The master rejected to attach an I2C device without 50ns Spike filter.
    */
    CY_I3C_MASTER_BAD_I2C_DEVICE = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 4U),

    /**
    * Unsupported CCC command 
    */
    CY_I3C_MASTER_CCC_NOT_SUPPORTED =(CY_I3C_ID | CY_PDL_STATUS_ERROR | 5U),

    /**
    * SDR Master Error Code M0 for Illegally formatted CCC Response
    */
    CY_I3C_MASTER_ERROR_M0 = ( CY_I3C_ID | CY_PDL_STATUS_ERROR | 6U ),

    /**
    * Error Type of the proccessed command received in Response Data Structure:
    * CRC Error
    */
    CY_I3C_MASTER_CRC_ERROR = ( CY_I3C_ID | CY_PDL_STATUS_ERROR | 7U ),

    /**
    * Error Type of the proccessed command received in Response Data Structure:
    * Parity Error
    */
    CY_I3C_MASTER_PARITY_ERROR = ( CY_I3C_ID | CY_PDL_STATUS_ERROR | 8U ),

    /**
    * Error Type of the proccessed command received in Response Data Structure:
    * Frame Error
    */
    CY_I3C_MASTER_FRAME_ERROR = ( CY_I3C_ID | CY_PDL_STATUS_ERROR | 9U ),

    /**
    * Error Type of the proccessed command received in Response Data Structure:
    * Broadcast Address NACK Error
    */
    CY_I3C_MASTER_BROADCAST_ADDR_NACK_ERROR = ( CY_I3C_ID | CY_PDL_STATUS_ERROR | 10U ),

    /**
    * Error Type of the proccessed command received in Response Data Structure:
    * Address NACK Error - Slave NACKs for the dynamic address assignment during 
    * ENTDAA process.
    */
    CY_I3C_MASTER_ADDR_NACK_ERROR = ( CY_I3C_ID | CY_PDL_STATUS_ERROR | 11U ),

    /**
    * Error Type of the proccessed command received in Response Data Structure:
    * TX/RX Buffer Overflow Error - Only for HDR Transfers
    */
    CY_I3C_MASTER_BUFFER_OVERFLOW_ERROR = ( CY_I3C_ID | CY_PDL_STATUS_ERROR | 12U ),

    /**
    * Error Type of the proccessed command received in Response Data Structure:
    * Transfer Aborted Error
    */
    CY_I3C_MASTER_XFER_ABORTED_ERROR = ( CY_I3C_ID | CY_PDL_STATUS_ERROR | 13U ),

    /**
    * Error Type of the proccessed command received in Response Data Structure:
    * I2C Slave Write Data NACK Error
    */
    CY_I3C_MASTER_I2C_SLV_WDATA_NACK_ERROR = ( CY_I3C_ID | CY_PDL_STATUS_ERROR | 14U ),

    /** The master NACKed the IBI */
    CY_I3C_MASTER_IBI_NACK = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 15U),
    
    /** The master ACKed the Mastership Request IBI */
    CY_I3C_MASTER_MR_IBI_ACK = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 16U),

    /** The master ACKed the Slave Interrupt Request IBI */
    CY_I3C_MASTER_SIR_IBI_ACK = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 17U),

    /** The master ACKed the Hot-join IBI */
    CY_I3C_MASTER_HOTJOIN_IBI_ACK = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 18U),
    
    /** Free address unavailable */
    CY_I3C_MASTER_FREE_ADDR_UNAVIAL = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 19U),

    /** The device is not HDR capable */
    CY_I3C_NOT_HDR_CAP = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 20U),

    /** The buffer size is greater than the FIFO size */
    CY_I3C_BAD_BUFFER_SIZE = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 21U),

    /** The secondary master responded with incorrect address to GETACCMST CCC */
    CY_I3C_ADDR_MISMATCH = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 22U),

    /** The device is not yet assigned a dynamic address */
    CY_I3C_ADDR_INVALID = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 23U),

    /** In Slave mode of operation, the Master has disabled SIR through DISEC */
    CY_I3C_SIR_DISABLED = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 24U),
    
    /** In Slave mode of operation, the Master has disabled MR through DISEC */
    CY_I3C_MR_DISABLED = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 25U),

    /** The Slave device failed to issue IBI */
    CY_I3C_IBI_NOT_ATTEMPTED = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 26U),

    /** There are no secondary master devices on the bus */
    CY_I3C_NO_SECONDARY_MASTER_DEVICES = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 27U),

    /** The slave device requested generation of hot-join event generation */ //tbd - provide more clarity in the comment
    CY_I3C_BAD_EVENT_REQ = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 28U),

    /** The device is not a secondary master */
    CY_I3C_NOT_SECONDARY_MASTER = (CY_I3C_ID | CY_PDL_STATUS_ERROR | 29U),

} cy_en_i3c_status_t;

/** I3C Operation Modes */
typedef enum
{
    CY_I3C_SLAVE                  = 1U,    /**< Configures I3C for Slave operation */
    CY_I3C_MASTER                 = 2U,    /**< Configures I3C for Main Master operation */
    CY_I3C_SECONDARY_MASTER       = 3U,    /**< Configures I3C for Secondory Master-Slave operation */
} cy_en_i3c_mode_t;

/** I3C Bus Modes */
typedef enum
{
    CY_I3C_BUS_PURE,        /**< Only I3C devices are connected to the bus. No limitation expected */
    CY_I3C_BUS_MIXED_FAST,  /**< I2C devices with 50ns spike filter are present on the bus.
                                 High SCL pulse has to stay below 50ns when transmitting I3C frames */
    CY_I3C_BUS_MIXED_SLOW,  /**< I2C devices without 50ns spike filter are present on the bus */
} cy_en_i3c_bus_mode_t;

/** I3C Address Slot Statuses */
typedef enum 
{
    CY_I3C_ADDR_SLOT_FREE,              /**< Address is free */
    CY_I3C_ADDR_SLOT_RSVD,              /**< Address is reserved */
    CY_I3C_ADDR_SLOT_I2C_DEV,           /**< Address is assigned to an I2C device */
    CY_I3C_ADDR_SLOT_I3C_DEV,           /**< Address is assigned to an I3C device */
    CY_I3C_ADDR_SLOT_STATUS_MASK = 3,   /**< Address slot mask */
}cy_en_i3c_addr_slot_status_t;

