ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_i3c.h
/** I3C IBI Types */
typedef enum
{
    CY_I3C_IBI_HOTJOIN,     /**< IBI Hot join Request */
    CY_I3C_IBI_SIR,         /**< IBI Slave Interrupt Request */
    CY_I3C_IBI_MASTER_REQ,  /**< IBI Master ownership Request */
} cy_en_i3c_ibi_type_t;

/** I3C Transaction IDs for HDR and SDR commands */
typedef enum
{
    CY_I3C_MASTER_SDR_WRITE_TID  = 1,     /**< TID for SDR Write Transfer */
    CY_I3C_MASTER_SDR_READ_TID   = 2,    /**< TID for SDR Read Transfer */
    CY_I3C_MASTER_HDR_WRITE_TID  = 3,    /**< TID for HDR Write Transfer */
    CY_I3C_MASTER_HDR_READ_TID   = 4,    /**< TID for HDR Read Transfer */
}cy_en_i3c_tid_t;

/** I3C Mode, SDR and HDR transfer speeds */ 
typedef enum
{
    CY_I3C_SDR0     = 0,         /**< I3C mode transfer speed - SDR0*/
    CY_I3C_SDR1     = 1,         /**< I3C mode transfer speed - SDR1*/
    CY_I3C_SDR2     = 2,         /**< I3C mode transfer speed - SDR2*/
    CY_I3C_SDR3     = 3,         /**< I3C mode transfer speed - SDR3*/
    CY_I3C_SDR4     = 4,         /**< I3C mode transfer speed - SDR4*/
    CY_I3C_HDR_DDR  = 6,         /**< I3C mode transfer speed - HDR-DDR */
}cy_en_i3c_data_speed_t;

/** I2C Mode, SDR transfer speeds */
typedef enum
{
    CY_I3C_FMP_I2C  = 0,      /**< I2C mode transfer speed - Fast Mode Plus */
    CY_I3C_FM_I2C   = 1,      /**< I2C mode transfer speed - Fast Mode */
}cy_en_i2c_data_speed_t;
/** \} group_i3c_enums */

/*******************************************************************************
*                              Type Definitions
*******************************************************************************/

/**
* \addtogroup group_i3c_data_structures
* \{
*/

/**
* I3C device IBI structure.
* Defines an IBI event.
*/
typedef struct cy_stc_i3c_ibi
{
    /** IBI event type */
    cy_en_i3c_ibi_type_t event;

    /** Address of the device requesting IBI */
    uint8_t slaveAddress;

    /** IBI Status. Indicates the master response for the received IBI */
    uint32_t status;
}cy_stc_i3c_ibi_t;

/**
* Provides the typedef for the callback function called in the
* \ref Cy_I3C_Interrupt to notify the user about occurrences of
* \ref group_i3c_macros_callback_events.
*/
typedef void (* cy_cb_i3c_handle_events_t)(uint32_t event);

/**
* Provides the typedef for the callback function called in the
* \ref Cy_I3C_Interrupt to notify the user about occurrences of
* \ref group_i3c_macros_callback_events.
*/
typedef void (* cy_cb_i3c_handle_ibi_t)(cy_stc_i3c_ibi_t *event);

/** 
* I2C device structure.
* Defines an I2C device.
* It is mandatory to provide I2C device static address and lvr information.
*/
typedef struct cy_stc_i2c_device
{
    /** Static address of the I2C device */
    uint8_t staticAddress;

    /** Legacy Virtual Register */
    uint8_t lvr;
} cy_stc_i2c_device_t;

/**
* I3C device structure.
* Defines an I3C device.
* StaticAddress of the I3C device if provided will be used by the controller
* to initiate the dynamic address assignment procedure through SETDASA.
* Desired I3C dynamic address to be used can be provided, but if set to zero,
* available free address will be assigned to the device by the controller.
*/
typedef struct cy_stc_i3c_device
{
    /** 48 bit provisional ID of I3C device */
    uint64_t provisonalID;

    /** Device Charactaristic Register of I3C device */
    uint8_t dcr;

    /** Bus Charactaristic Register of I3C device */
    uint8_t bcr;

    /** Static address of the I3C device if used */
    uint8_t staticAddress;

    /**
    * Desired dynamic address for I3C device.
    * If set to zero, available free address will be assigned by I3C controller.
    */
    uint8_t dynamicAddress;

    /** Max private SDR read length in bytes */
    uint16_t mrl;

    /** Max private SDR write length in bytes */
    uint16_t mwl;

    /** Max read speed information */
    uint8_t maxReadDs;

    /** Max write speed information */
    uint8_t maxWriteDs;

    /** Max read turn-around time in micro -seconds */
    uint8_t maxReadTurnaround[3];

    /** Supported HDR modes */
    uint8_t HDRCap;

    /** 
    * Support for HDR Mode.
    * true: HDR modes supported. HDRCap member for the device is valid.
    * false: HDR modes are not supported.
    */
    bool hdrSupport; 

    /**
    * Max data speed limitation.
    * true: Limitation on max data speed. maxReadDs, maxWriteDs, maxReadTurnaround members for the device are valid
    * false: No limitation on max data speed
    */
    bool speedLimit;
}cy_stc_i3c_device_t;

/** A local list of devices on the bus */
typedef struct cy_stc_i3c_master_devlist
{
    /** Identifies the device type */
    bool i2c;

    /** I2C/I3C device descriptor */
    union
    {     
        cy_stc_i3c_device_t i3cDevice;
        cy_stc_i2c_device_t i2cDevice;
    };
}cy_stc_i3c_master_devlist_t;

/** Device Charactersitic Table structure */
typedef struct cy_stc_i3c_dev_char
{
    uint32_t LSBProvisionalID; /**< The LSB 32-bit value of provisional ID */
    uint32_t MSBProvisionalID; /**< The MSB 16-bit value of provisional ID */
    uint32_t DCR_BCR;          /**< DCR [7:0] and BCR [15:8] of the I3C device */
    uint32_t dynamicAddress;   /**< Dynamic address [7:0] of the I3C device */
}cy_stc_i3c_dev_char_t;

/** 64-bit CCC structure */
typedef struct cy_stc_i3c_ccc
{
    uint32_t cmdHigh;     /**< cmdHigh */
    uint32_t cmdLow;      /**< cmdLow */
}cy_stc_i3c_ccc_t;

/** I3C bus configuration structure */
typedef struct cy_stc_i3c_config
{
    /** Specifies the mode of I3C controller operation */
    cy_en_i3c_mode_t i3cMode;

    /** Specifies the mode of I3C bus operation */
    cy_en_i3c_bus_mode_t i3cBusMode;

    /** Use the SDMA for Rx/Tx */
    bool useDma;

    /** The frequency of the clock connected to the I3C block in Hz. */
    uint32_t i3cClockHz;

    /** The desired I3C data Rate in Hz. */
    uint32_t i3cSclRate;
    
    /** SDR only or SDR and HDR capable 
        true: SDR and HDR
        false: SDR only
    */
    bool hdrCapable;
    
    /**
    * Max data speed limitation.
    * true: Limitation on max data speed. maxReadDs, maxWriteDs, maxReadTurnaround members for the device are valid
    * false: No limitation on max data speed
    */
    bool speedLimit;

    /** The device characteristic value of the I3C Device */
    uint8_t dcr;

