ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_i3c.h
    /** The Provisional ID of the Device */
    uint64_t pid;

    /** Below members are only applicable for the Slave mode */

    /** The static address of the I3C Slave Device, if present */
    uint8_t staticAddress;

    /** Enable/Disable Hot-join */
    bool hotjoinEnable;

} cy_stc_i3c_config_t;

/** I3C CCC command payload structure */
typedef struct cy_stc_i3c_ccc_payload
{
    /** Payload length */
    uint16_t len;
    
    /** Payload data */
    void *data;
} cy_stc_i3c_ccc_payload_t;

/** I3C CCC command structure */
typedef struct cy_stc_i3c_ccc_cmd
{
    /** CCC command id */
    uint8_t cmd;
    
    /** CCC command payload or NULL */
    cy_stc_i3c_ccc_payload_t *data;
    
    /** Destination address */
    uint8_t address;
}cy_stc_i3c_ccc_cmd_t;

/** I3C Master information */
typedef struct cy_stc_i3c_master
{
    /** two bits per address to depict the status of the addresses - 8*4*8 */
    unsigned long addrslotsStatusArray[((CY_I3C_MAX_ADDR + 1) * 2) / CY_I3C_BITS_PER_LONG];
    
    /** immediate last address, from the address list, assigned as dynamic address to the slave device  */
    int8_t lastAddress;
    
    /** index of the free position wrt the Device Address Table */
    uint32_t freePos;
    
    /** the number of devices on the bus */
    uint32_t devCount;
    
    /** Count of i2c devices on the bus */
    uint32_t i2cDeviceCount; 
    
    /** Number of dynamically addressed devices */
    uint32_t dynAddrDevCount;
}cy_stc_i3c_master_t;

/** I3C HDR command Structure */
typedef struct cy_stc_i3c_hdr_cmd 
{
    /**
    * Command opcode. Bit 7 encodes the direction of the data transfer, if
    * set this is a read, otherwise this is a write.
    */
    uint8_t code;
    
    /** Number of data words (a word is 16bits wide) to transfer */
    uint32_t ndatawords;
    
    /** Input/Output buffer */
    union 
    {
        uint16_t *in;
        const uint16_t *out;
    }data;
}cy_stc_i3c_hdr_cmd_t;


/**
* I3C context structure.
* All fields for the context structure are internal. Firmware never reads or
* writes these values. Firmware allocates the structure and provides the
* address of the structure to the driver in function calls. Firmware must
* ensure that the defined instance of this structure remains in scope
* while the drive is in use.
*/
typedef struct cy_stc_i3c_context
{
    /** \cond INTERNAL */

    volatile uint32_t state;    /**< The driver state */
    cy_en_i3c_mode_t i3cMode;   /** Specifies the mode of i3c controller operation */
    cy_en_i3c_bus_mode_t i3cBusMode;     /** Specifies the mode of i3c bus operation */

    uint32_t i3cSclRate;
    uint32_t i3cClockHz;

    volatile uint32_t masterStatus; /**< The master status */

    uint8_t  *masterBuffer;     /**< The pointer to the master buffer (either for a transmit or a receive operation) */
    uint32_t  masterBufferSize;         /**< The current master buffer size */
    volatile uint32_t masterBufferIdx;  /**< The current location in the master buffer */
    volatile uint8_t destDeviceAddr; /**< The destination device address in the transfers */

    volatile uint32_t slaveStatus;       /**< The slave status */
    volatile bool     slaveRdBufEmpty;   /**< Tracks slave Read buffer empty event */

    uint8_t  *slaveTxBuffer;             /**< The pointer to the slave transmit buffer (a master reads from it) */
    uint32_t  slaveTxBufferSize;         /**< The current slave transmit buffer size */
    volatile uint32_t slaveTxBufferIdx;  /**< The current location in the slave buffer */
    volatile uint32_t slaveTxBufferCnt;  /**< The number of transferred bytes */

    uint8_t  *slaveRxBuffer;             /**< The pointer to the slave receive buffer (a master writes into it) */
    uint32_t  slaveRxBufferSize;         /**< The current slave receive buffer size */
    volatile uint32_t slaveRxBufferIdx;  /**< The current location in the slave buffer */
    volatile uint32_t slaveRxBufferCnt;

    cy_stc_i3c_master_t i3cMaster;       /**< I3C Master bus details */

    cy_stc_i3c_master_devlist_t devList[CY_I3C_MAX_DEVS]; /**< The list of devices on the bus */

    cy_stc_i3c_hdr_cmd_t *hdrCmd; /** <Maintains the HDR command sent */

    /**
    * The pointer to an event callback that is called when any of
    * \ref group_i3c_macros_callback_events occurs
    */
    cy_cb_i3c_handle_events_t cbEvents;

    /**
    * The pointer to an event callback that is called when any of
    * \ref group_i3c_macros_ibi_events occurs
    */
    cy_cb_i3c_handle_ibi_t    cbIbi;

    /** \endcond */
} cy_stc_i3c_context_t;

/** The I3C Master transfer structure */
typedef struct cy_stc_i3c_master_xfer_config
{
    /** The 7-bit right justified slave address to communicate with */
    uint8_t  slaveAddress;

    /**
    * The pointer to the buffer for data to read from the slave or 
    * data to write into the slave
    */
    uint8_t  *buffer;

    /** The size of the buffer */
    uint32_t bufferSize;

    /** toc */
    bool toc;
} cy_stc_i3c_master_xfer_config_t;

/** \} group_i3c_data_structures */


/*******************************************************************************
*                            Function Prototypes
*******************************************************************************/

/**
* \addtogroup group_i3c_general_functions
* \{
*/
cy_en_i3c_status_t Cy_I3C_Init(I3C_CORE_Type *base, cy_stc_i3c_config_t const *config, cy_stc_i3c_context_t *context);
void Cy_I3C_DeInit(I3C_CORE_Type *base,cy_stc_i3c_context_t *context);
void Cy_I3C_Enable(I3C_CORE_Type *base);
void Cy_I3C_Disable(I3C_CORE_Type *base);
void Cy_I3C_Resume(I3C_CORE_Type *base, cy_stc_i3c_context_t *context);
bool Cy_I3C_IsBusBusy(I3C_CORE_Type const *base);
bool  Cy_I3C_IsMaster(I3C_CORE_Type const *base);
cy_en_i3c_mode_t Cy_I3C_GetMode(I3C_CORE_Type const *base);
void Cy_I3C_Interrupt (I3C_CORE_Type *base, cy_stc_i3c_context_t *context);
void Cy_I3C_RegisterEventCallback(I3C_CORE_Type const *base, cy_cb_i3c_handle_events_t callback, cy_stc_i3c_context_t *context);
void Cy_I3C_RegisterIbiCallback (I3C_CORE_Type const *base, cy_cb_i3c_handle_ibi_t callback, cy_stc_i3c_context_t *context);

/** \} group_i3c_general_functions */

/**
* \addtogroup group_i3c_master_functions
* \{
*/
cy_en_i3c_status_t Cy_I3C_MasterAttachI2CDevice(I3C_CORE_Type *base, cy_stc_i2c_device_t *i2cDevice, cy_stc_i3c_context_t *context);
cy_en_i3c_status_t Cy_I3C_MasterDetachI2CDevice(I3C_CORE_Type *base, cy_stc_i2c_device_t *i2cDevice, cy_stc_i3c_context_t *context);
cy_en_i3c_status_t Cy_I3C_MasterAttachI3CDevice(I3C_CORE_Type *base, cy_stc_i3c_device_t *i3cDevice, cy_stc_i3c_context_t *context);
cy_en_i3c_status_t Cy_I3C_MasterDetachI3CDevice(I3C_CORE_Type *base, cy_stc_i3c_device_t *i3cDevice, cy_stc_i3c_context_t *context);
uint32_t Cy_I3C_GetI2CDeviceCount(I3C_CORE_Type *base, cy_stc_i3c_context_t *context);
uint32_t Cy_I3C_GetI3CDeviceCount(I3C_CORE_Type *base, cy_stc_i3c_context_t *context);
uint32_t Cy_I3C_SetDataRate(I3C_CORE_Type *base, uint32_t dataRateHz, uint32_t i3cClockHz, cy_stc_i3c_context_t *context);
uint32_t Cy_I3C_GetDataRate(I3C_CORE_Type const *base, cy_stc_i3c_context_t *context);
cy_en_i3c_status_t Cy_I3C_MasterGetI2CDevices(I3C_CORE_Type *base, cy_stc_i2c_device_t *i2cDeviceList, cy_stc_i3c_context_t *context);
cy_en_i3c_status_t Cy_I3C_MasterGetI3CDevices(I3C_CORE_Type *base, cy_stc_i3c_device_t *i3cDeviceList, cy_stc_i3c_context_t *context);
cy_en_i3c_status_t Cy_I3C_MasterGetFreeDeviceAddress(I3C_CORE_Type *base, uint8_t *address, cy_stc_i3c_context_t *context);
bool Cy_I3C_isCCCCmdSupported(I3C_CORE_Type *base, uint8_t cccCmd, cy_stc_i3c_context_t *context);
cy_en_i3c_status_t Cy_I3C_SendCCCCmd(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context);
cy_en_i3c_status_t Cy_I3C_DisableDeviceIbi(I3C_CORE_Type *base, cy_stc_i3c_device_t *i3cDevice, cy_stc_i3c_context_t *context);
cy_en_i3c_status_t Cy_I3C_EnableDeviceIbi(I3C_CORE_Type *base, cy_stc_i3c_device_t *i3cDevice, cy_stc_i3c_context_t *context);
cy_en_i3c_status_t Cy_I3C_MasterWrite(I3C_CORE_Type *base, cy_stc_i3c_master_xfer_config_t *xferConfig, cy_stc_i3c_context_t *context);
cy_en_i3c_status_t Cy_I3C_MasterRead (I3C_CORE_Type *base, cy_stc_i3c_master_xfer_config_t* xferConfig, cy_stc_i3c_context_t *context);
void Cy_I3C_MasterAbortTransfer(I3C_CORE_Type *base, cy_stc_i3c_context_t *context);
cy_en_i3c_status_t Cy_I3C_MasterWriteByte(I3C_CORE_Type *base, uint8_t slaveAddress, int8_t data, cy_stc_i3c_context_t *context);
cy_en_i3c_status_t Cy_I3C_MasterReadByte(I3C_CORE_Type *base, uint8_t slaveAddress, int8_t *data, cy_stc_i3c_context_t *context);
uint32_t Cy_I3C_GetBusStatus(I3C_CORE_Type const *base, cy_stc_i3c_context_t const *context);
cy_en_i3c_status_t Cy_I3C_MasterStartEntDaa(I3C_CORE_Type *base, cy_stc_i3c_context_t *context);
cy_en_i3c_status_t Cy_I3C_MasterSendHdrCmds(I3C_CORE_Type *base, uint8_t slaveAddress, cy_stc_i3c_hdr_cmd_t *hdrCmd, cy_stc_i3c_context_t *context);

/** \} group_i3c_master_functions */


/**
* \addtogroup group_i3c_slave_functions
* \{
*/
cy_en_i3c_status_t Cy_I3C_SlaveGetDynamicAddress(I3C_CORE_Type const *base, uint8_t *address, cy_stc_i3c_context_t const *context);
uint32_t Cy_I3C_SlaveGetMaxReadLength(I3C_CORE_Type const *base, cy_stc_i3c_context_t const *context);
uint32_t Cy_I3C_SlaveGetMaxWriteLength(I3C_CORE_Type const *base, cy_stc_i3c_context_t const *context);
cy_en_i3c_status_t Cy_I3C_SlaveGenerateIbi(I3C_CORE_Type *base, cy_stc_i3c_ibi_t *ibitype, cy_stc_i3c_context_t *context);
void Cy_I3C_SlaveConfigReadBuf (I3C_CORE_Type const *base, uint8_t *buffer, uint32_t size, cy_stc_i3c_context_t *context);
uint32_t Cy_I3C_SlaveGetReadTransferCount (I3C_CORE_Type const *base, cy_stc_i3c_context_t const *context);
void Cy_I3C_SlaveConfigWriteBuf(I3C_CORE_Type const *base, uint8_t *buffer, uint32_t size, cy_stc_i3c_context_t *context);
uint32_t Cy_I3C_SlaveGetWriteTransferCount (I3C_CORE_Type const *base, cy_stc_i3c_context_t const *context);

/** \} group_i3c_slave_functions */

/**
* \addtogroup group_i3c_secondary_master_functions
* \{
*/
cy_en_i3c_status_t Cy_I3C_RequestMastership(I3C_CORE_Type *base, cy_stc_i3c_context_t *context);
cy_en_i3c_status_t Cy_I3C_DeliverMastership(I3C_CORE_Type *base, uint8_t SecMasterAddress, cy_stc_i3c_context_t *context);

