ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_i3c.h
/** \} group_i3c_secondary_master_functions */

/**
* \addtogroup group_i3c_interrupt_functions
* \{
*/
void Cy_I3C_SlaveInterrupt (I3C_CORE_Type *base, cy_stc_i3c_context_t *context);
void Cy_I3C_MasterInterrupt (I3C_CORE_Type *base, cy_stc_i3c_context_t *context);
/** \cond INTERNAL */
void Cy_I3C_SecondaryMasterInterrupt (I3C_CORE_Type *base, cy_stc_i3c_context_t *context);
/** \endcond */
/** \} group_i3c_interrupt_functions */

/**
* \addtogroup group_i3c_low_power_functions
* \{
*/
cy_en_syspm_status_t Cy_I3C_DeepSleepCallback(cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode);
cy_en_syspm_status_t Cy_I3C_HibernateCallback(cy_stc_syspm_callback_params_t *callbackParams, cy_en_syspm_callback_mode_t mode);
/** \} group_i3c_low_power_functions */

/*******************************************************************************
*                     In-line Function Implementation
*******************************************************************************/

/**
* \addtogroup group_i3c_general_functions
* \{
*/

/*******************************************************************************
* Function Name: Cy_I3C_GetInterruptStatus
****************************************************************************//**
* 
* Returns the interrupt request register. This register contains the current
* status of the interrupt sources.
*
* \param base
* The pointer to the I3C instance.
*
* \return
* The current status of the interrupt sources.
* Each constant is a bit field value. The value returned may have multiple
* bits set to indicate the current status.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_I3C_GetInterruptStatus(I3C_CORE_Type *base)
{
    return(I3C_CORE_INTR_STATUS(base) & CY_I3C_INTR_MASK);
}

/*******************************************************************************
* Function Name: Cy_I3C_ClearInterrupt
****************************************************************************//**
* 
* Clears the interrupt sources in the interrupt request register.
*
* \param base
* The pointer to the I3C instance.
*
* \param interruptMask
* Interrupt sources to be cleared.
*
*******************************************************************************/
__STATIC_INLINE void Cy_I3C_ClearInterrupt(I3C_CORE_Type *base, uint32_t interruptMask)
{
    CY_ASSERT_L2(CY_I3C_INTR_VALID(interruptMask, CY_I3C_INTR_MASK));
    I3C_CORE_INTR_STATUS(base) = interruptMask;
}

/*******************************************************************************
* Function Name: Cy_I3C_SetInterrupt
****************************************************************************//**
* 
* Sets interrupt sources in the interrupt request register.
*
* \param base
* The pointer to the I3C instance.
*
* \param interruptMask
* The interrupt sources to set in the interrupt request register.
*
*******************************************************************************/
__STATIC_INLINE void Cy_I3C_SetInterrupt(I3C_CORE_Type *base, uint32_t interruptMask)
{
    CY_ASSERT_L2(CY_I3C_INTR_VALID(interruptMask, CY_I3C_INTR_MASK));
    I3C_CORE_INTR_FORCE(base) = interruptMask;
}

/*******************************************************************************
* Function Name: Cy_I3C_GetInterruptStatus
****************************************************************************//**
* 
* Returns the interrupt signal enable register.
* This register specifies which bits from the interrupt request register
* can trigger an interrupt event.
*
* \param base
* The pointer to the I3C instance.
*
* \return
* Enabled interrupt sources.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_I3C_GetInterruptMask(I3C_CORE_Type *base)
{
    return(I3C_CORE_INTR_SIGNAL_EN(base));
}

/*******************************************************************************
* Function Name: Cy_I3C_SetInterrupt
****************************************************************************//**
* 
* Writes the I3C interrupt signal enable register. 
* This register specifies which bits
* from the I3C interrupt request register can trigger an interrupt event.
*
* \param base
* The pointer to the I3C instance.
*
* \param interruptMask
* Enabled interrupt sources.
*
*******************************************************************************/
__STATIC_INLINE void Cy_I3C_SetInterruptMask(I3C_CORE_Type *base, uint32_t interruptMask)
{
    CY_ASSERT_L2(CY_I3C_INTR_VALID(interruptMask, CY_I3C_INTR_MASK));
    I3C_CORE_INTR_SIGNAL_EN(base) = interruptMask;

}

/*******************************************************************************
* Function Name: SetInterruptStatusMask
****************************************************************************//**
*
* Writes the I3C interrupt status enable register. This register specifies which bits
* from the I3C interrupt request register can trigger an interrupt event.
*
* \param base
* The pointer to the I3C instance.
*
* \param interruptMask
* Enabled I3C interrupt sources.
*
*******************************************************************************/
__STATIC_INLINE void Cy_I3C_SetInterruptStatusMask (I3C_CORE_Type *base, uint32_t interruptMask)
{
    CY_ASSERT_L2(CY_I3C_INTR_VALID(interruptMask, CY_I3C_INTR_MASK));
    I3C_CORE_INTR_STATUS_EN(base) = interruptMask;
}

/*******************************************************************************
*  Function Name: Cy_I3C_WriteIntoDeviceAddressTable
****************************************************************************//**
*
* Writes the value into the specified location of the DAT.
*
* \param base
* The pointer to the I3C instance.
* 
* \param index
* The offset from the base of the DAT.
*
* \param value
* The value to be written at the specified location in the DAT.
*
*******************************************************************************/
__STATIC_INLINE void Cy_I3C_WriteIntoDeviceAddressTable(I3C_CORE_Type *base, uint8_t index, uint32_t value)
{
    volatile uint32_t *ptr;
    ptr = &(I3C_CORE_DEV_ADDR_TABLE_LOC1(base));

    ptr = ptr + index;

    *ptr = value;
}

