ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_i3c.h
/*******************************************************************************
* Function Name: Cy_I3C_ReadDynAddrFromDAT
****************************************************************************//**
* 
* Returns the dynamic address of the I3C device stored in the DAT.
*
* \param base
* The pointer to the I3C instance.
*
* \param index
* The offset from the base of the DAT.
*
* \return
* The dynamic address of the I3C device.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_I3C_ReadDynAddrFromDAT(I3C_CORE_Type *base, uint8_t index)
{
    volatile uint32_t *ptr;
    uint32_t addr;

    ptr = &(I3C_CORE_DEV_ADDR_TABLE_LOC1(base));

    ptr = ptr + index;

    addr = _FLD2VAL(I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_DYNAMIC_ADDR, *ptr);
    
    return (0x7F & addr);
}

/*******************************************************************************
* Function Name: Cy_I3C_ReadStaticAddrFromDAT
****************************************************************************//**
* Returns the static address of the I2C device stored in the DAT.
*
* \param base
* The pointer to the I3C instance.
*
* \param index
* The offset from the base of the DAT.
*
* \return
* The static address of the I2C device.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_I3C_ReadStaticAddrFromDAT(I3C_CORE_Type *base, uint8_t index)
{
    volatile uint32_t *ptr;
    ptr = &(I3C_CORE_DEV_ADDR_TABLE_LOC1(base));

    ptr = ptr + index;

    return ((*ptr) & I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_STATIC_ADDR_Msk);
}

/*******************************************************************************
* Function Name: Cy_I3C_ReadFromDevCharTable
****************************************************************************//**
* Populates the i3c device defined by \ref cy_stc_i3c_device_t with the 
* DCR, BCR, PID and dynamic address information from the DCT.
*
* \param base
* The pointer to the I3C instance.
*
* \param index
* The offset from the base of the DAT.
*
* \param i3cDevice
* The pointer to the i3c device description structure \ref cy_stc_i3c_device_t.
*
*******************************************************************************/
__STATIC_INLINE void Cy_I3C_ReadFromDevCharTable(I3C_CORE_Type *base, uint8_t index, cy_stc_i3c_device_t *i3cDevice)
{
    cy_stc_i3c_dev_char_t *ptr;
    
    ptr = (cy_stc_i3c_dev_char_t *)&(I3C_CORE_DEV_CHAR_TABLE1_LOC1(base));
    ptr = ptr + index;
    i3cDevice->provisonalID = ((uint64_t)(ptr->LSBProvisionalID));
    i3cDevice->provisonalID |= ((uint64_t)(ptr->MSBProvisionalID) << 32UL);
    i3cDevice->dcr = I3C_CORE_DEV_CHAR_TABLE1_LOC3_DCR_Msk & (ptr->DCR_BCR);
    i3cDevice->bcr = _FLD2VAL(I3C_CORE_DEV_CHAR_TABLE1_LOC3_BCR, (ptr->DCR_BCR));
    i3cDevice->dynamicAddress = ptr->dynamicAddress;
}

/*******************************************************************************
*  Function Name: Cy_I3C_UpdateI3CDevInList
****************************************************************************//**
*
* Adds the I3C device to the list of devices \ref cy_stc_i3c_master_devlist_t
* present on the bus.
* 
* \param i3cDevice
* The pointer to the I3C device description structure \ref cy_stc_i3c_device_t.
*
* \param pos
* The position of the device in the list \ref cy_stc_i3c_master_devlist_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
__STATIC_INLINE void Cy_I3C_UpdateI3CDevInList(cy_stc_i3c_device_t *i3cDevice, uint8_t pos, cy_stc_i3c_context_t *context)
{
    context->devList[pos].i2c = false;
    context->devList[pos].i3cDevice = *i3cDevice;
}

/*******************************************************************************
*  Function Name: Cy_I3C_UpdateI2CDevInList
****************************************************************************//**
*
* Adds the I2C device to the list of devices \ref cy_stc_i3c_master_devlist_t
* present on the bus.
* 
* \param i2cDevice
* The pointer to the I2C device description structure \ref cy_stc_i2c_device_t.
*
* \param pos
* The position of the device in the list \ref cy_stc_i3c_master_devlist_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
__STATIC_INLINE void Cy_I3C_UpdateI2CDevInList(cy_stc_i2c_device_t *i2cDevice, uint8_t pos, cy_stc_i3c_context_t *context)
{
    context->devList[pos].i2c = true;
    context->devList[pos].i2cDevice = *i2cDevice;
}

/*******************************************************************************
* Function Name: Cy_I3C_ReadRxFIFO
****************************************************************************//**
*
* Reads a data element directly out of the RX FIFO.
* This function does not check whether the RX FIFO has data before reading it.
*
* \param base
* The pointer to the I3C instance.
*
* \return
* Data from RX FIFO.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_I3C_ReadRxFIFO(I3C_CORE_Type *base)
{
    return (I3C_CORE_TX_RX_DATA_PORT(base));
}

/*******************************************************************************
* Function Name: Cy_I3C_WriteTxFIFO
****************************************************************************//**
*
* Writes data directly into the TX FIFO.
* This function does not check whether the TX FIFO is not full before writing
* into it.
*
* \param base
* The pointer to the I3C instance.
*
* \param data
* Data to write to the TX FIFO.
*
*******************************************************************************/
__STATIC_INLINE void Cy_I3C_WriteTxFIFO(I3C_CORE_Type *base, uint32_t data)
{
    I3C_CORE_TX_RX_DATA_PORT(base) = data;
}

