ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_i3c.h
/*******************************************************************************
* Function Name: Cy_I3C_GetFreeEntriesInTxFifo
****************************************************************************//**
*
* Provides the number of empty locations in the TX FIFO.
*
* \param base
* The pointer to the I3C instance.
*
* \return
* Transmit buffer empty level value.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_I3C_GetFreeEntriesInTxFifo(I3C_CORE_Type *base)
{
    return _FLD2VAL(I3C_CORE_DATA_BUFFER_STATUS_LEVEL_TX_BUF_EMPTY_LOC, I3C_CORE_DATA_BUFFER_STATUS_LEVEL(base));
}

/*******************************************************************************
* Function Name: Cy_I3C_GetFreeEntriesInRxFifo
****************************************************************************//**
*
* Provides the number of empty locations in the RX FIFO.
*
* \param base
* The pointer to the I3C instance.
*
* \return
* Receive buffer empty level value.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_I3C_GetFreeEntriesInRxFifo(I3C_CORE_Type *base)
{
    return ((CY_I3C_FIFO_SIZE/4) - _FLD2VAL(I3C_CORE_DATA_BUFFER_STATUS_LEVEL_RX_BUF_BLR, I3C_CORE_DATA_BUFFER_STATUS_LEVEL(base)));
}

/*******************************************************************************
* Function Name: Cy_I3C_SetRxFifoLevel
****************************************************************************//**
*
* Sets the RX FIFO level. When there are more data elements in the RX FIFO than
* this level, the RX FIFO level interrupt is triggered.
*
* \param base
* The pointer to the I3C instance.
*
* \param level
* When there are more data elements in the FIFO than this level, the RX level
* interrupt is triggered.
*
*******************************************************************************/
__STATIC_INLINE void Cy_I3C_SetRxFifoLevel(I3C_CORE_Type *base, uint32_t level)
{
    CY_REG32_CLR_SET(I3C_CORE_DATA_BUFFER_THLD_CTRL(base), I3C_CORE_DATA_BUFFER_THLD_CTRL_RX_BUF_THLD, level);
}

/*******************************************************************************
* Function Name: Cy_SCB_GetRxFifoLevel
****************************************************************************//**
*
* Returns the RX FIFO level. When there are more words in the RX FIFO than the
* threshold level, the RX FIFO level interrupt is triggered.
*
* \param base
* The pointer to the I3C instance.
*
* \return
* RX FIFO level.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_I3C_GetRxFifoLevel(CySCB_Type const *base)
{
    return _FLD2VAL(I3C_CORE_DATA_BUFFER_THLD_CTRL_RX_BUF_THLD, I3C_CORE_DATA_BUFFER_THLD_CTRL(base));
}

/*******************************************************************************
* Function Name: Cy_I3C_SetTxEmptyThldLevel
****************************************************************************//**
*
* Sets the TX FIFO level. When the number of empty locations in the TX FIFO is
* greater than this level, the TX FIFO level interrupt is triggered.
*
* \param base
* The pointer to the I3C instance.
*
* \param level
* When there are more empty locations in the TX FIFO than this level, 
* the TX level interrupt is triggered.
*
*******************************************************************************/
__STATIC_INLINE void Cy_I3C_SetTxEmptyThldLevel(CySCB_Type const *base, uint32_t level)
{
    CY_REG32_CLR_SET(I3C_CORE_DATA_BUFFER_THLD_CTRL(base), I3C_CORE_DATA_BUFFER_THLD_CTRL_TX_EMPTY_BUF_THLD, level);
}

/** \} group_i3c_general_functions */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXI3C */

#endif /* (CY_I3C_H) */

/** \} group_i3c */

/* [] END OF FILE */

